IlleniumDillon/MM32F5277/PinMap/MM32_TIM_PinMap.c
#include "MM32_TIM_PinMap.h"

MM32_TIM_Pin TIM1_BKIN1_PA6 = {.periBase = TIM1, .port = GPIOA, .pin = P06, .af = AF01, .chNum = TIM_BKIN};
MM32_TIM_Pin TIM1_CH1N_PA7  = {.periBase = TIM1, .port = GPIOA, .pin = P07, .af = AF01, .chNum = TIM_CH1N};
MM32_TIM_Pin TIM1_CH1_PA8   = {.periBase = TIM1, .port = GPIOA, .pin = P08, .af = AF01, .chNum = TIM_CH1};
MM32_TIM_Pin TIM1_CH2_PA9   = {.periBase = TIM1, .port = GPIOA, .pin = P09, .af = AF01, .chNum = TIM_CH2};
MM32_TIM_Pin TIM1_CH3_PA10  = {.periBase = TIM1, .port = GPIOA, .pin = P10, .af = AF01, .chNum = TIM_CH3};
MM32_TIM_Pin TIM1_CH4_PA11  = {.periBase = TIM1, .port = GPIOA, .pin = P11, .af = AF01, .chNum = TIM_CH4};
MM32_TIM_Pin TIM1_ETR_PA12  = {.periBase = TIM1, .port = GPIOA, .pin = P12, .af = AF01, .chNum = TIM_ETR};

MM32_TIM_Pin TIM1_CH2N_PB0  = {.periBase = TIM1, .port = GPIOB, .pin = P00, .af = AF01, .chNum = TIM_CH2N};
MM32_TIM_Pin TIM1_CH3N_PB1  = {.periBase = TIM1, .port = GPIOB, .pin = P01, .af = AF01, .chNum = TIM_CH3N};
MM32_TIM_Pin TIM1_CH4N_PB2  = {.periBase = TIM1, .port = GPIOB, .pin = P02, .af = AF01, .chNum = TIM_CH4N};
MM32_TIM_Pin TIM1_BKIN2_PB12= {.periBase = TIM1, .port = GPIOB, .pin = P12, .af = AF01, .chNum = TIM_BKIN};
MM32_TIM_Pin TIM1_CH1N_PB13 = {.periBase = TIM1, .port = GPIOB, .pin = P13, .af = AF01, .chNum = TIM_CH1N};
MM32_TIM_Pin TIM1_CH2N_PB14 = {.periBase = TIM1, .port = GPIOB, .pin = P14, .af = AF01, .chNum = TIM_CH2N};
MM32_TIM_Pin TIM1_CH3N_PB15 = {.periBase = TIM1, .port = GPIOB, .pin = P15, .af = AF01, .chNum = TIM_CH3N};

MM32_TIM_Pin TIM1_BKIN3_PC0 = {.periBase = TIM1, .port = GPIOC, .pin = P00, .af = AF01, .chNum = TIM_BKIN};

MM32_TIM_Pin TIM1_ETR_PE7   = {.periBase = TIM1, .port = GPIOE, .pin = P07, .af = AF01, .chNum = TIM_ETR};
MM32_TIM_Pin TIM1_CH1N_PE8  = {.periBase = TIM1, .port = GPIOE, .pin = P08, .af = AF01, .chNum = TIM_CH1N};
MM32_TIM_Pin TIM1_CH1_PE9   = {.periBase = TIM1, .port = GPIOE, .pin = P09, .af = AF01, .chNum = TIM_CH1};
MM32_TIM_Pin TIM1_CH2N_PE10 = {.periBase = TIM1, .port = GPIOE, .pin = P10, .af = AF01, .chNum = TIM_CH2N};
MM32_TIM_Pin TIM1_CH2_PE11  = {.periBase = TIM1, .port = GPIOE, .pin = P11, .af = AF01, .chNum = TIM_CH2};
MM32_TIM_Pin TIM1_CH3N_PE12 = {.periBase = TIM1, .port = GPIOE, .pin = P12, .af = AF01, .chNum = TIM_CH3N};
MM32_TIM_Pin TIM1_CH3_PE13  = {.periBase = TIM1, .port = GPIOE, .pin = P13, .af = AF01, .chNum = TIM_CH3};
MM32_TIM_Pin TIM1_CH4_PE14  = {.periBase = TIM1, .port = GPIOE, .pin = P14, .af = AF01, .chNum = TIM_CH4};
MM32_TIM_Pin TIM1_BKIN4_PE15= {.periBase = TIM1, .port = GPIOE, .pin = P15, .af = AF01, .chNum = TIM_BKIN};

MM32_TIM_Pin TIM1_ETR_PH2   = {.periBase = TIM1, .port = GPIOH, .pin = P02, .af = AF01, .chNum = TIM_ETR};

MM32_TIM_Pin TIM1_CH4N_PI0  = {.periBase = TIM1, .port = GPIOI, .pin = P00, .af = AF01, .chNum = TIM_CH4N};


MM32_TIM_Pin TIM2_ETR_PA0   = {.periBase = TIM2, .port = GPIOA, .pin = P00, .af = AF01, .chNum = TIM_ETR};
MM32_TIM_Pin TIM2_CH1_PA0   = {.periBase = TIM2, .port = GPIOA, .pin = P00, .af = AF01, .chNum = TIM_CH1};
MM32_TIM_Pin TIM2_CH2_PA1   = {.periBase = TIM2, .port = GPIOA, .pin = P01, .af = AF01, .chNum = TIM_CH2};
MM32_TIM_Pin TIM2_CH3_PA2   = {.periBase = TIM2, .port = GPIOA, .pin = P02, .af = AF01, .chNum = TIM_CH3};
MM32_TIM_Pin TIM2_CH4_PA3   = {.periBase = TIM2, .port = GPIOA, .pin = P03, .af = AF01, .chNum = TIM_CH4};
MM32_TIM_Pin TIM2_CH1_PA5   = {.periBase = TIM2, .port = GPIOA, .pin = P05, .af = AF01, .chNum = TIM_CH1};
MM32_TIM_Pin TIM2_ETR_PA5   = {.periBase = TIM2, .port = GPIOA, .pin = P05, .af = AF01, .chNum = TIM_ETR};
MM32_TIM_Pin TIM2_CH1_PA15  = {.periBase = TIM2, .port = GPIOA, .pin = P15, .af = AF01, .chNum = TIM_CH1};
MM32_TIM_Pin TIM2_ETR_PA15  = {.periBase = TIM2, .port = GPIOA, .pin = P15, .af = AF01, .chNum = TIM_ETR};

MM32_TIM_Pin TIM2_CH2_PB3   = {.periBase = TIM2, .port = GPIOB, .pin = P03, .af =AF01, .chNum = TIM_CH2};
MM32_TIM_Pin TIM2_CH3_PB10  = {.periBase = TIM2, .port = GPIOB, .pin = P10, .af =AF01, .chNum = TIM_CH3};
MM32_TIM_Pin TIM2_CH4_PB11  = {.periBase = TIM2, .port = GPIOB, .pin = P11, .af =AF01, .chNum = TIM_CH4};

MM32_TIM_Pin TIM2_ETR_PI1   = {.periBase = TIM2, .port = GPIOI, .pin = P01, .af =AF01, .chNum = TIM_ETR};


MM32_TIM_Pin TIM3_ETR_PA5   = {.periBase = TIM3, .port = GPIOA, .pin = P05, .af = AF02, .chNum = TIM_ETR};
MM32_TIM_Pin TIM3_CH1_PA6   = {.periBase = TIM3, .port = GPIOA, .pin = P06, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM3_CH2_PA7   = {.periBase = TIM3, .port = GPIOA, .pin = P07, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM3_ETR_PA8   = {.periBase = TIM3, .port = GPIOA, .pin = P08, .af = AF02, .chNum = TIM_ETR};

MM32_TIM_Pin TIM3_CH3_PB0   = {.periBase = TIM3, .port = GPIOB, .pin = P00, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM3_CH4_PB1   = {.periBase = TIM3, .port = GPIOB, .pin = P01, .af = AF02, .chNum = TIM_CH4};
MM32_TIM_Pin TIM3_CH1_PB4   = {.periBase = TIM3, .port = GPIOB, .pin = P04, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM3_CH2_PB5   = {.periBase = TIM3, .port = GPIOB, .pin = P05, .af = AF02, .chNum = TIM_CH2};

MM32_TIM_Pin TIM3_CH1_PC6   = {.periBase = TIM3, .port = GPIOC, .pin = P06, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM3_CH2_PC7   = {.periBase = TIM3, .port = GPIOC, .pin = P07, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM3_CH3_PC8   = {.periBase = TIM3, .port = GPIOC, .pin = P08, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM3_CH4_PC9   = {.periBase = TIM3, .port = GPIOC, .pin = P09, .af = AF02, .chNum = TIM_CH4};

MM32_TIM_Pin TIM3_ETR_PD2   = {.periBase = TIM3, .port = GPIOD, .pin = P02, .af = AF02, .chNum = TIM_ETR};

MM32_TIM_Pin TIM3_CH1_PE2   = {.periBase = TIM3, .port = GPIOE, .pin = P02, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM3_CH2_PE3   = {.periBase = TIM3, .port = GPIOE, .pin = P03, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM3_CH3_PE4   = {.periBase = TIM3, .port = GPIOE, .pin = P04, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM3_CH4_PE5   = {.periBase = TIM3, .port = GPIOE, .pin = P05, .af = AF02, .chNum = TIM_CH4};
MM32_TIM_Pin TIM3_CH3_PE6   = {.periBase = TIM3, .port = GPIOE, .pin = P06, .af = AF02, .chNum = TIM_CH3};


MM32_TIM_Pin TIM4_ETR_PB3   = {.periBase = TIM4, .port = GPIOB, .pin = P03, .af = AF02, .chNum = TIM_ETR};
MM32_TIM_Pin TIM4_CH1_PB6   = {.periBase = TIM4, .port = GPIOB, .pin = P06, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM4_CH2_PB7   = {.periBase = TIM4, .port = GPIOB, .pin = P07, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM4_CH3_PB8   = {.periBase = TIM4, .port = GPIOB, .pin = P08, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM4_CH4_PB9   = {.periBase = TIM4, .port = GPIOB, .pin = P09, .af = AF02, .chNum = TIM_CH4};

MM32_TIM_Pin TIM4_ETR_PD11  = {.periBase = TIM4, .port = GPIOD, .pin = P11, .af = AF02, .chNum = TIM_ETR};
MM32_TIM_Pin TIM4_CH1_PD12  = {.periBase = TIM4, .port = GPIOD, .pin = P12, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM4_CH2_PD13  = {.periBase = TIM4, .port = GPIOD, .pin = P13, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM4_CH3_PD14  = {.periBase = TIM4, .port = GPIOD, .pin = P14, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM4_CH4_PD15  = {.periBase = TIM4, .port = GPIOD, .pin = P15, .af = AF02, .chNum = TIM_CH4};

MM32_TIM_Pin TIM4_ETR_PE0   = {.periBase = TIM4, .port = GPIOE, .pin = P00, .af = AF02, .chNum = TIM_ETR};


MM32_TIM_Pin TIM5_CH1_PA0   = {.periBase = TIM5, .port = GPIOA, .pin = P00, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM5_CH2_PA1   = {.periBase = TIM5, .port = GPIOA, .pin = P01, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM5_CH3_PA2   = {.periBase = TIM5, .port = GPIOA, .pin = P02, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM5_CH4_PA3   = {.periBase = TIM5, .port = GPIOA, .pin = P03, .af = AF02, .chNum = TIM_CH4};
MM32_TIM_Pin TIM5_ETR_PA4   = {.periBase = TIM5, .port = GPIOA, .pin = P04, .af = AF02, .chNum = TIM_ETR};

MM32_TIM_Pin TIM5_ETR_PB12  = {.periBase = TIM5, .port = GPIOB, .pin = P12, .af = AF02, .chNum = TIM_ETR};

MM32_TIM_Pin TIM5_ETR_PF6   = {.periBase = TIM5, .port = GPIOF, .pin = P06, .af = AF02, .chNum = TIM_ETR};
MM32_TIM_Pin TIM5_CH1_PF6   = {.periBase = TIM5, .port = GPIOF, .pin = P06, .af = AF02, .chNum = TIM_CH1};
MM32_TIM_Pin TIM5_CH2_PF7   = {.periBase = TIM5, .port = GPIOF, .pin = P07, .af = AF02, .chNum = TIM_CH2};
MM32_TIM_Pin TIM5_CH3_PF8   = {.periBase = TIM5, .port = GPIOF, .pin = P08, .af = AF02, .chNum = TIM_CH3};
MM32_TIM_Pin TIM5_CH4_PF9   = {.periBase = TIM5, .port = GPIOF, .pin = P09, .af = AF02, .chNum = TIM_CH4};

MM32_TIM_Pin TIM5_ETR_PI1   = {.periBase = TIM5, .port = GPIOI, .pin = P01, .af = AF02, .chNum = TIM_ETR};


MM32_TIM_Pin TIM8_ETR_PA0   = {.periBase = TIM8, .port = GPIOA, .pin = P00, .af = AF03, .chNum = TIM_ETR};
MM32_TIM_Pin TIM8_CH1N_PA5  = {.periBase = TIM8, .port = GPIOA, .pin = P05, .af = AF03, .chNum = TIM_CH1N};
MM32_TIM_Pin TIM8_BKIN1_PA6 = {.periBase = TIM8, .port = GPIOA, .pin = P06, .af = AF03, .chNum = TIM_BKIN};
MM32_TIM_Pin TIM8_CH1N_PA7  = {.periBase = TIM8, .port = GPIOA, .pin = P07, .af = AF03, .chNum = TIM_CH1N};

MM32_TIM_Pin TIM8_CH2N_PB0  = {.periBase = TIM8, .port = GPIOB, .pin = P00, .af = AF03, .chNum = TIM_CH2N};
MM32_TIM_Pin TIM8_CH3N_PB1  = {.periBase = TIM8, .port = GPIOB, .pin = P01, .af = AF03, .chNum = TIM_CH3N};
MM32_TIM_Pin TIM8_CH4N_PB2  = {.periBase = TIM8, .port = GPIOB, .pin = P02, .af = AF03, .chNum = TIM_CH4N};
MM32_TIM_Pin TIM8_CH3N_PB5  = {.periBase = TIM8, .port = GPIOB, .pin = P05, .af = AF03, .chNum = TIM_CH3N};
MM32_TIM_Pin TIM8_CH4N_PB6  = {.periBase = TIM8, .port = GPIOB, .pin = P06, .af = AF03, .chNum = TIM_CH4N};
MM32_TIM_Pin TIM8_CH1N_PB8  = {.periBase = TIM8, .port = GPIOB, .pin = P08, .af = AF03, .chNum = TIM_CH1N};
MM32_TIM_Pin TIM8_CH2N_PB9  = {.periBase = TIM8, .port = GPIOB, .pin = P09, .af = AF03, .chNum = TIM_CH2N};
MM32_TIM_Pin TIM8_CH1N_PB13 = {.periBase = TIM8, .port = GPIOB, .pin = P13, .af = AF03, .chNum = TIM_CH1N};
MM32_TIM_Pin TIM8_CH2N_PB14 = {.periBase = TIM8, .port = GPIOB, .pin = P14, .af = AF03, .chNum = TIM_CH2N};
MM32_TIM_Pin TIM8_CH3N_PB15 = {.periBase = TIM8, .port = GPIOB, .pin = P15, .af = AF03, .chNum = TIM_CH3N};

MM32_TIM_Pin TIM8_BKIN2_PC1 = {.periBase = TIM8, .port = GPIOC, .pin = P01, .af = AF03, .chNum = TIM_BKIN};
MM32_TIM_Pin TIM8_CH1_PC6   = {.periBase = TIM8, .port = GPIOC, .pin = P06, .af = AF03, .chNum = TIM_CH1};
MM32_TIM_Pin TIM8_CH2_PC7   = {.periBase = TIM8, .port = GPIOC, .pin = P07, .af = AF03, .chNum = TIM_CH2};
MM32_TIM_Pin TIM8_CH3_PC8   = {.periBase = TIM8, .port = GPIOC, .pin = P08, .af = AF03, .chNum = TIM_CH3};
MM32_TIM_Pin TIM8_CH4_PC9   = {.periBase = TIM8, .port = GPIOC, .pin = P09, .af = AF03, .chNum = TIM_CH4};
MM32_TIM_Pin TIM8_CH1_PC13  = {.periBase = TIM8, .port = GPIOC, .pin = P13, .af = AF03, .chNum = TIM_CH1};
MM32_TIM_Pin TIM8_CH2_PC14  = {.periBase = TIM8, .port = GPIOC, .pin = P14, .af = AF03, .chNum = TIM_CH2};
MM32_TIM_Pin TIM8_CH3_PC15  = {.periBase = TIM8, .port = GPIOC, .pin = P15, .af = AF03, .chNum = TIM_CH3};

MM32_TIM_Pin TIM8_ETR_PH2   = {.periBase = TIM8, .port = GPIOH, .pin = P02, .af = AF03, .chNum = TIM_ETR};

MM32_TIM_Pin TIM8_CH4_PI0   = {.periBase = TIM8, .port = GPIOI, .pin = P00, .af = AF03, .chNum = TIM_CH4};
MM32_TIM_Pin TIM8_ETR_PI1   = {.periBase = TIM8, .port = GPIOI, .pin = P01, .af = AF03, .chNum = TIM_ETR};